package card

const personCardTemplate = `
🧑‍💼<b>ФИО</b>
%s

📍<b>Город</b>
%s

🏛 <b>Организация</b>
%s

💼 <b>Должность</b>
%s

📝 <b>Экспертные компетенции</b>
%s

🤝 <b>Направления возможного сотрудничества</b>
%s

📱<b>Контакты для связи</b>
%s`

const organizationCardTemplate = `
🏛 <b>Организация</b>
%s

🏢 <b>Структурное подразделение</b>
%s

📍<b>Город</b>
%s

🤝 <b>Направления возможного сотрудничества</b>
%s

🌐 <b>Членство в консорциуме</b>
%s

🚀 <b>«Приоритет-2030»</b>
%s

⚛️ <b>Разработки отечественного ПО</b>
%s

🔬 <b>Лабораторные площадки и НОЦ</b>
%s`
